{
  "basics": {
    "name": "Paul Chavez",
    "label": "Software Engineer with over 3 years of experience",
    "image": "/me.gif",
    "email": "paulchavezromero20@gmail.com",
    "phone": "+51 957383385",
    "whatsApp": "51957383385",
    "url": "https://developaul.com",
    "summary": "+3 years as a Software Engineer, I have led projects that have made a significant impact on efficiency and user experience. My passion for innovation drives me to continue contributing my expertise in dynamic environments while pursuing further professional growth.",
    "summaryTitle": "About me",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "lima",
      "countryCode": "PE",
      "region": "Peru"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "developaul",
        "url": "https://linkedin.com/in/developaul"
      },
      {
        "network": "X",
        "username": "developaul",
        "url": "https://x.com/developaul"
      },
      {
        "network": "GitHub",
        "username": "developaul",
        "url": "https://github.com/developaul"
      },
      {
        "network": "Youtube",
        "username": "developaul",
        "url": "https://www.youtube.com/@developaul"
      }
    ]
  },
  "work": [
    {
      "name": "krowdy",
      "position": "Software Engineer",
      "url": "https://www.krowdy.com",
      "startDate": "2021-04-19",
      "endDate": "2024-04-30",
      "summary": [
        "Mejoré la interacción de los clientes con el sistema de entregas al permitirles calificar y comentar sobre los candidatos. Reduje el tiempo de respuesta de los clientes con los reclutadores, pasando de semanas a solo horas, mediante la implementación de APIs y un servicio de notificaciones programadas utilizando colas con Bull, Redis y SES para garantizar la sincronización de todos los implicados.",
        "Implementé geolocalización basada en la IP del usuario para obtener su ubicación automáticamente, simplificando y acelerando el proceso de postulación para el candidato al obtener su ubicación de forma automática.",
        "Implementé integraciones con módulos de FFMPEG controlados por workers de Node.js en los servicios de procesamiento de video, lo que resultó en mejoras significativas en la reducción del peso de los vídeos hasta un 90% y garantizando la compatibilidad con varios navegadores mediante el soporte de diversos codecs y formatos de vídeo.",
        "Incrementé la cantidad de postulaciones por semana en un 250% mediante la implementación de webhooks y formularios de Facebook y Google Ads utilizando Node.js, SES y MongoDB.",
        "Mejoré la eficiencia del equipo de reclutadores al centralizar la comunicación y los estados de los procesos que estaban llevando, proporcionando una plataforma más organizada y eficaz para la colaboración interna.",
        "Implementé la importación y exportación de datos de ofertas y candidatos en el ATS al desarrollar un proceso de scraping para múltiples bolsas de trabajo utilizando Puppeteer. Este enfoque resultó en un importante aumento de la monetización para la empresa.",
        "Mejoré la experiencia de usuario al liderar la actualización del landing page principal de la empresa utilizando Astro, GSAP, TypeScript y Mixpanel para rastrear las métricas de la página.",
        "Optimicé el análisis empresarial de nuestros productos digitales al implementar eventos utilizando Mixpanel y Lucky Orange, lo que proporcionó información valiosa para la toma de decisiones estratégicas.",
        "Desarrollé servicios backend en Node.js aplicando tecnologías como GraphQL y microservicios, lo que llevó a una reducción del 70% en la carga de procesamiento y un aumento del 90% en la satisfacción del usuario gracias a consultas y respuestas más rápidas. Estas mejoras fueron posibles mediante la implementación de DataLoaders y el desacoplamiento de Backing Services.",
        "Desarrollé tecnologías para monitorear campañas de Email Marketing y Email Transaccional utilizando tecnologías como S3, SES de AWS y Restify con Node.js en el lado del servidor. Esto resultó en un aumento del 2000% en el volumen de envío de correos electrónicos y una mejora del 200% en las tasas de apertura.",
        "mplementé módulos de tareas del ATS para integrar herramientas internas como Formularios, Gestión de Documentos y Gestión de CVs. Utilicé tecnologías de gestión de colas (Better Queue) y notificaciones (SES) en AWS para garantizar un proceso eficiente y sincronizado.",
        "Mejoré la calidad del código al realizar revisión de código, lo que resultó en una disminución en errores de producción y una mejora en la calidad del código a través de la evaluación de complejidad, acoplamiento, cohesión, mantenibilidad y rendimiento de recursos.",
        "Participé como profesor en la creación de un programa educacional llamado Krowdy Academy para entrenar desarrolladores juniors en tecnologías backend, frontend y reliability"
      ],
      "highlights": [
        "Started the company"
      ]
    },
    {
      "name": "CIK",
      "position": "Desktop Application Developer",
      "url": "https://cikpe.com",
      "startDate": "2021-04-01",
      "endDate": "2021-05-01",
      "summary": [
        "Lideré el desarrollo de una aplicación de escritorio multiplataforma para etiquetado automático de fotos, utilizando Bootstrap, JavaScript, ReactJs, NodeJs y ElectronJs.",
        "Logré eliminar el etiquetado manual, automatizando el proceso al 100% integrando tecnologías para garantizar compatibilidad y adaptando la aplicación a las necesidades del usuario."
      ],
      "highlights": [
        "Started the company"
      ]
    }
  ],
  "workTitle": "Most recent work experience",
  "defaultEndDate": "Currently",
  "education": [
    {
      "institution": "ICPNA",
      "url": "https://www.icpna.edu.pe/",
      "area": "English",
      "studyType": "Language",
      "startDate": "2022-02-01",
      "endDate": null,
      "score": "",
      "courses": [
        ""
      ]
    },
    {
      "institution": "SENATI",
      "url": "https://www.senati.edu.pe/",
      "area": "Information and Communication Technologies",
      "studyType": "Technical",
      "startDate": "2019-02-01",
      "endDate": "2020-02-01",
      "score": "",
      "courses": [
        ""
      ]
    }
  ],
  "projects": [
    {
      "name": "Stylus Shop",
      "isActive": true,
      "description": "La tienda en línea de ropa ofrece autenticación y pagos a través de PayPal, además de características como guardar favoritos, una sección para añadir nuevo stock y otra para rastrear las ventas realizadas y en proceso.",
      "highlights": [
        "Vende tu propia ropa",
        "Pagos online"
      ],
      "url": "https://stylus-shop.vercel.app/",
      "github": "https://github.com/developaul/stylus-shop"
    },
    {
      "name": "Task Manager",
      "isActive": true,
      "description": "Task Manager es una aplicación para organizar tareas en las siguientes categorias To do, In Progress, Done para mantener cierta organización a la hora de realizar tareas.",
      "highlights": [
        "Clon de trello",
        "Optimiza tu gestión de tareas"
      ],
      "url": "https://task-manager-cd8af.web.app/",
      "github": "https://github.com/developaul/task-manager-react"
    },
    {
      "name": "Movie App",
      "isActive": true,
      "description": "Aplicación Web de películas, donde podras visualizar trailers desde las últimas peliculas hasta las clasicas.",
      "highlights": [
        "Mirar últimos tráilers",
        "Películas"
      ],
      "url": "https://keen-wilson-cf2ebe.netlify.app/",
      "github": "https://github.com/developaul/movie-react"
    }
  ],
  "skills": [
    {
      "name": "HTML",
      "level": "Master",
      "keywords": []
    },
    {
      "name": "CSS",
      "level": "Master",
      "keywords": []
    },
    {
      "name": "JavaScript",
      "level": "Master",
      "keywords": []
    },
    {
      "name": "Tailwind",
      "level": "Avanzado",
      "keywords": []
    },
    {
      "name": "TypeScript",
      "level": "Avanzado",
      "keywords": []
    },
    {
      "name": "Node",
      "level": "Avanzado",
      "keywords": []
    },
    {
      "name": "MySQL",
      "level": "Avanzado",
      "keywords": []
    },
    {
      "name": "Git",
      "level": "Avanzado",
      "keywords": []
    },
    {
      "name": "GitHub",
      "level": "Avanzado",
      "keywords": []
    },
    {
      "name": "Next",
      "level": "Avanzado",
      "keywords": []
    },
    {
      "name": "React",
      "level": "Avanzado",
      "keywords": []
    }
  ]
}