{
  "basics": {
    "name": "Paul Chavez",
    "label": "Software Engineer with over 3 years of experience",
    "image": "/me.gif",
    "email": "paulchavezromero20@gmail.com",
    "phone": "+51 957383385",
    "whatsApp": "51957383385",
    "url": "https://developaul.com",
    "summary": "+3 years of experience leading projects aimed at enhancing efficiency and user experience, I am passionate about innovation and professional growth in dynamic environments.",
    "summaryTitle": "About me",
    "location": {
      "address": "",
      "postalCode": "",
      "city": "lima",
      "countryCode": "PE",
      "region": "Peru"
    },
    "profiles": [
      {
        "network": "LinkedIn",
        "username": "developaul",
        "url": "https://linkedin.com/in/developaul"
      },
      {
        "network": "X",
        "username": "developaul",
        "url": "https://x.com/developaul"
      },
      {
        "network": "GitHub",
        "username": "developaul",
        "url": "https://github.com/developaul"
      },
      {
        "network": "Youtube",
        "username": "developaul",
        "url": "https://www.youtube.com/@developaul"
      }
    ]
  },
  "work": [
    {
      "name": "krowdy",
      "position": "Software Engineer",
      "url": "https://www.krowdy.com",
      "startDate": "2021-04-19",
      "endDate": "2024-04-30",
      "summary": [
        "Enhanced client interaction with the delivery system by allowing them to rate and comment on candidates. Reduced client response time with recruiters from days to just hours by implementing APIs and a scheduled notification service using TypeScript, NodeJs, Bull, Redis, and AWS SES to ensure synchronization among all parties involved.",
        "Designed and developed an IP-based geolocation service, simplifying the application process by automatically obtaining the user's location using TypeScript, NodeJs, and Express in a microservices architecture to ensure system accuracy and efficiency.",
        "Implemented integrations with FFMPEG modules controlled by TypeScript and NodeJs workers in video processing services, resulting in significant improvements in video size reduction up to 90% and ensuring compatibility with various browsers through support for diverse video codecs and formats.",
        "Increased weekly applications by 250% by implementing webhooks and forms from Facebook and Google Ads using TypeScript, NodeJs, SES, and MongoDB.",
        "Enhanced recruiter team efficiency by centralizing communication and process statuses, providing a more organized and effective platform for internal collaboration using TypeScript, React, Material-UI, NodeJs, GraphQL, MongoDB, PostgreSQL, and AWS SES.",
        "Implemented data import and export for job offers and candidates in the ATS by developing a scraping process for multiple job boards using TypeScript, NodeJs, Puppeteer, and Cheerio, resulting in a significant increase in company monetization.",
        "Improved user experience by leading the update of the company's main landing page using TypeScript, Astro, Tailwind CSS, GSAP, and Mixpanel to track page metrics, achieving a perfect 100% score on Google PageSpeed insights and enhancing performance, accessibility, and SEO.",
        "Optimized business analysis of digital products by implementing events using Mixpanel and Lucky Orange, providing valuable insights for strategic decision-making.",
        "Developed backend services in NodeJs with TypeScript, applying technologies such as GraphQL and microservices, leading to a 70% reduction in processing load and a 90% increase in user satisfaction due to faster queries and responses. These improvements were made possible through the implementation of DataLoaders and the decoupling of Backing Services.",
        "Developed technologies to monitor Email Marketing and Transactional Email campaigns using technologies such as AWS S3, SES, SNS, and Restify with Node.js on the server side. This resulted in a 2000% increase in email delivery volume and a 200% improvement in open rates.",
        "Improved event processing efficiency by implementing AWS EventBridge with AWS Lambda functions, making the most of serverless architecture capabilities. Used AWS CDK to define and deploy infrastructure efficiently, enabling more agile and scalable management of cloud resources.",
        "Implemented ATS task modules to integrate internal tools such as Forms, Document Management, and CV Management. Used queue management (Better Queue) and notification (SES) technologies on AWS to ensure efficient and synchronized processes.",
        "Improved code quality by conducting code reviews, resulting in a decrease in production errors and an improvement in code quality through evaluation of complexity, coupling, cohesion, maintainability, and resource performance.",
        "Participated as a teacher in the creation of an educational program called Krowdy Academy to train junior developers in backend, frontend, and reliability technologies."
      ],
      "highlights": ["Remote"]
    },
    {
      "name": "CIK",
      "position": "Desktop Application Developer",
      "url": "https://cikpe.com",
      "startDate": "2021-04-01",
      "endDate": "2021-05-01",
      "summary": [
        "Led the development of a cross-platform desktop application for automatic photo tagging, using Bootstrap, JavaScript, ReactJs, NodeJs, and ElectronJs.",
        "Achieved 100% manual tagging elimination by automating the process, integrating technologies to ensure compatibility, and tailoring the application to user needs."
      ],
      "highlights": ["Remote"]
    }
  ],
  "education": [
    {
      "institution": "ICPNA",
      "url": "https://www.icpna.edu.pe/",
      "area": "English",
      "studyType": "Language",
      "startDate": "2022-02-01",
      "endDate": null,
      "score": "",
      "courses": [""]
    },
    {
      "institution": "SENATI",
      "url": "https://www.senati.edu.pe/",
      "area": "Information and Communication Technologies",
      "studyType": "Technical",
      "startDate": "2019-02-01",
      "endDate": "2020-02-01",
      "score": "",
      "courses": [""]
    }
  ],
  "projects": [
    {
      "name": "Translate App",
      "isActive": true,
      "description": "Translate instantly into multiple languages with quick real-time responses accessible on any device! Additionally, it supports translation of images and documents.",
      "highlights": [
        "Light/Dark mode",
        "Cross-platform",
        "Text translation",
        "Image translation",
        "Document translation"
      ],
      "url": "https://talk-translate.vercel.app/",
      "github": "https://github.com/developaul/translate-app"
    },
    {
      "name": "Transcribe App",
      "isActive": true,
      "description": "Convert audio to text effortlessly. Light/dark mode, English transcriptions, cross-platform, and secure transcription management with integrated authentication.",
      "highlights": ["Light/dark mode", "Cross-platform"],
      "url": "https://transcribe-app-next.vercel.app/",
      "github": "https://github.com/developaul/transcribe-app"
    },
    {
      "name": "Stylus Shop",
      "isActive": true,
      "description": "The online clothing store offers authentication and payments through PayPal, along with features such as saving favorites, a section to add new stock, and another to track sales made and in progress.",
      "highlights": ["Sell your own clothes", "Online payments"],
      "url": "https://stylus-shop.vercel.app/",
      "github": "https://github.com/developaul/stylus-shop"
    },
    {
      "name": "Task Manager",
      "isActive": true,
      "description": "Task Manager is an application for organizing tasks into the following categories: To do, In Progress, Done, to maintain a certain level of organization when performing tasks.",
      "highlights": ["Trello clone", "Optimize your task management"],
      "url": "https://task-manager-cd8af.web.app/",
      "github": "https://github.com/developaul/task-manager-react"
    },
    {
      "name": "Movie App",
      "isActive": true,
      "description": "Web application for movies, where you can watch trailers from the latest releases to classics.",
      "highlights": ["Watch latest trailers", "Movies"],
      "url": "https://keen-wilson-cf2ebe.netlify.app/",
      "github": "https://github.com/developaul/movie-react"
    }
  ],
  "skills": [
    "HTML",
    "CSS",
    "SASS",
    "Tailwind",
    "Boostrap",
    "Styled Components",
    "Material-UI",
    "Shadcn/ui",
    "JavaScript",
    "TypeScript",
    "Node",
    "React",
    "Redux",
    "Next",
    "Restify",
    "Express",
    "Graphql",
    "Puppeteer",
    "Cheerio",
    "Socket",
    "Docker",
    "Jest",
    "Mocha",
    "Ffmpeg",
    "AWS",
    "Cloudinary",
    "Git",
    "GitHub",
    "GitLab",
    "StoryBook",
    "Bash",
    "MongoDB",
    "PostgreSQL",
    "MySQL",
    "Redis",
    "Elasticsearch",
    "Firebase",
    "Mixpanel",
    "Electron",
    "Astro",
    "Metabase",
    "Hubspot Developer",
    "Linux"
  ],
  "alts": {
    "workTitle": "Most recent work experience",
    "educationTitle": "Education",
    "defaultEndDate": "Currently",
    "ProjectsTitle": "Projects",
    "SkillTitle": "Skills"
  }
}
